/*Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".
Умови виконання ДЗ
1. Рік отримувати через prompt()
2. Зробити перевірку що користувачь ввів число та це число не є відємним
3. Не використовувати функції або інші матеріали які ми не вивчали
4. Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки.*/

let prompt = require('prompt');

prompt.start();

prompt.get(['years'], function (err, result) {
  if (!err) {
    let year = parseInt(result.years);

    if (!isNaN(year) && year >= 0) {
      let wordForm;

      if (year === 0 || year >= 5) {
        wordForm = "років";
      } else if (year === 1) {
        wordForm = "рік";
      } else {
        wordForm = "роки";
      }

      console.log(`Кількість років: ${year} ${wordForm}`);
    } else {
      console.log("Будь ласка, введіть невід'ємне число.");
    }
  } else {
    console.error("Помилка вводу:", err);
  }
});
