/*Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:
Кілометри в метри
години в хвилини
Кілограми в грами
Зробити вивід отриманої інформації у вигляді - 10 км це 10000 м. 1 г це 60хв. 1 кг. це 1000 грм.
Умови виконання ДЗ
В задачі не обовязково викорисутовувати prompt, просто запишіть значення в зміні
Обовязково при написані завдання використовуйте switch
Продумати варінат якщо буде введена якась інша одиниця виміру
Мудрувати та створювати валідацію не потрібно*/


let unit = "км"; 
let quantity = 10;

function convertUnits(unit, quantity) {
  let result;
  switch (unit) {
    case "км":
      result = `${quantity} км це ${quantity * 1000} м.`;
      break;
    case "год":
      result = `${quantity} год це ${quantity * 60} хв.`;
      break;
    case "кг":
      result = `${quantity} кг це ${quantity * 1000} г.`;
      break;
    default:
      result = "Невідома одиниця виміру.";
  }
  return result;
}

console.log(convertUnits(unit, quantity));
