/*Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
Якось так:
drawTriangle(5, *);
*
**
***
****
*****
Умови виконання ДЗ
Домашню роботу необхідно зробити двома способами
В задачі не потрібно використовувати prompt або щось інше повязане з UI
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки*/



function drawTriangle(height, symbol) {
    for (let i = 1; i <= height; i++) {
        let row = symbol.repeat(i);
        console.log(row);
    }
}

drawTriangle(5, '*');

function drawTriangle(height, symbol) {
    for (let i = 1; i <= height; i++) {
        let row = '';
        for (let j = 1; j <= i; j++) {
            row += symbol;
        }
        console.log(row);
    }
}

drawTriangle(5, '*');


