/*ДЗ1 Тусувати масив 
Ми знаємо як відсортувати масив. А ось спробуйте його перемішати!
Приклад масиву: arr = [1, 2, 3, 4, 5, 6, 7, 8, 9]; 
Напишіть функцію myBlend(arr), яка перемішуватиме переданий їй масив. 
Зверніть увагу: не створювати новий масив, вже перемішаний, а саме перемішувати той, який їй передали.*/

function myBlend(arr) {
    var n = arr.length;

    for (var i = n - 1; i > 0; i--) {
        var j = Math.floor(Math.random() * (i + 1));
        var temp = arr[i];
        arr[i] = arr[j];
        arr[j] = temp;
    }
}

var arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
console.log("Початковий масив:", arr);

myBlend(arr);
console.log("Перемішаний масив:", arr);


